const cyArr = `置之死地
打飞机
中流砥柱
老成持重
天下第一
css
取而代之
赤子之心
自知之明
孜孜不倦
死心塌地
不三不四
坑
不毛之地
因地制宜
不蔓不枝
规规矩矩
挺身而出
不自量力
哈哈
沾沾自喜
天涯海角
目瞪口呆
恭恭敬敬
666
明察秋毫
hello
星星之火
三省吾身
怦然心动
王侯将相
白虹贯日
不可胜数
出人头地
javascript
自暴自弃
如坐针毡
地灵人杰
礼贤下士
自寻烦恼
三顾茅庐
鸿鹄之志
老司机
不耻下问
被坚执锐
腰缠万贯
一鼓作气
无精打采
乐此不疲
门庭若市
万籁俱寂
爆菊花
豁然开朗
鸡犬不宁
死而无怨
辗转反侧
破铜烂铁
骇人听闻
QQ
空中楼阁
声名狼藉
奋不顾身
百折不挠
不名一钱
千乘之国
天了噜
脚踏实地
走投无路
百无聊赖
车水马龙
精明强干
不干不净
信口开河
杀一儆百
生花妙笔
一钱不值
有条有理
礼尚往来
捡肥皂
毕恭毕敬
学富五车
残羹冷炙
死有余辜
及锋而试
千变万化
对酒当歌
标新立异
雕栏玉砌
情随事迁
高风亮节
钩心斗角
滚
大煞风景
不远千里
游刃有余
对牛弹琴
择善而从
冥顽不灵
意气扬扬
心悦诚服
低声下气
甜言蜜语
素不相识
国色天香
惊惶失措
败军之将
悔之无及
面面相觑
言过其实
萌萌哒
得意扬扬
自惭形秽
改朝换代
不识时务
顿开茅塞
一言为定
兵荒马乱
老态龙钟
老气横秋
万全之策
尽善尽美
人艰不拆
何足挂齿
不通世务
回光返照
有天无日
死于非命
初出茅庐
形影相吊
纸上谈兵
呵呵
人杰地灵
气息奄奄
无出其右
茕茕孑立
如泣如诉
见义勇为
蹉跎岁月
高朋满座
生离死别
涨姿势
举案齐眉
物华天宝
老骥伏枥
悬梁刺股
无所适从
冯唐易老
啥
朝不虑夕
千载难逢
老当益壮
改弦更张
千锤百炼
各自为政
克己复礼
呜呼
敬而远之
竭尽全力
势均力敌
不时之需
寻根究底
兢兢业业
西格玛
一笔勾销
生死永别
刀枪不入
杯弓蛇影
不约而同
语无伦次
妙手回春
老气横秋
安之若素
一马当先
百无聊赖
不知所云
醉生梦死
朝夕相处
张灯结彩
斩钉截铁
载歌载舞
转悲为喜
遮天盖地
战无不胜
指手画脚
震耳欲聋
坐井观天
左顾右盼
专心致志
张冠李戴
自作自受
置之不理
争先恐后
纵横交错
炙手可热
助人为乐
重于泰山
抓耳挠腮
卓有成效
座无虚席
自由自在
坐卧不安
赞叹不已
真情实感
震天动地
争奇斗艳
枝繁叶茂
追根求源
自生自灭
众星拱月
一模一样
鸦雀无声
扬长而去
奄奄一息`.split(/\n|\s+/)
console.log(cyArr)
/*

 夜以继日	晚上连着白天。形容加紧工作或学习。
 养尊处优	养：指生活。指生活在有人伺候、条件优裕的环境中。
 摇头摆尾	原形容鱼悠然自在的样子。现用来形容人摇头晃脑、轻浮得意的样子。
 一去不复返	一去就不再回来了。
 严阵以待	指做好充分战斗准备，等待着敌人。
 一团漆黑	形容一片黑暗，没有一点光明。也形容对事情一无所知。
 一片冰心	冰心：清洁的心。形容性情淡泊，不求名利。
 依依不舍	依依：依恋的样子；舍：放弃。形容舍不得离开。
 一无所有	什么也没有。指钱财，也指成绩、知识。
 摇头晃脑	晃：摇动。脑袋摇来摇去。形容自己感觉很有乐趣或自己认为很不差的样子。
 一切众生	佛教指人类和一切生物。
 一本正经	原指一部合乎道德规范的经典。后用以形容态度庄重严肃，郑重其事。有时含讽刺意味。
 一寸光阴一寸金	比喻时间十分富贵。
 一如既往	指态度没有变化，完全象从前一样。
 莺歌燕舞	黄莺在歌唱，小燕子在飞舞。形容春天鸟儿喧闹活跃的景象。现常比喻革命和建设蓬勃兴旺的景象。
 耀武扬威	耀：显扬。炫耀武力，显示威风。
 一溜烟	形容跑得很快。
 愚不可及	愚：傻，笨，及：比得上。愚蠢得别人比不上。形容极其愚笨。
 一望无际	际：边。一眼望不到边。形容非常辽阔。
 一应俱全	一应：一切；俱：都。一切齐全，应有尽有。
 原封不动	原封：没有开封。原来贴的封口没有动过。比喻完全按照原样，一点不加变动。
 异想天开	异：奇异；天开：比喻凭空的、根本没有的事情。指想法很不切实际，非常奇怪。
 有朝一日	将来有那么一天。
 一来二去	指一回又一回，经过一段时间。表示逐渐的意思。
 引人注目	注目：注视。吸引人们注意。
 游手好闲	指人游荡懒散，不愿参加劳动。
 有生以来	从出生到现在。
 与世长辞	辞：告别。和人世永别了。指去世。
 应接不暇	暇：空闲。原形容景物繁多，来不及观赏。后多形容来人或事情太多，应付不过来。
 应有尽有	该有的全都有。形容很齐全。
 一泻千里
 */